Sambulov/COS/MCU/ARM/Gigadevice/GD32F103VG/Port/Inc/port_core.h
#ifdef GD32F10X_HD
  HDL_NVIC_IRQ19_USBD_HP_CAN0_TX             = 19,     /*!< CAN0 TX interrupts                                       */
  HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0            = 20,     /*!< CAN0 RX0 interrupts                                      */
  HDL_NVIC_IRQ21_CAN0_RX1                    = 21,     /*!< CAN0 RX1 interrupts                                      */
  HDL_NVIC_IRQ22_CAN0_EWMC                   = 22,     /*!< CAN0 EWMC interrupts                                     */
  HDL_NVIC_IRQ23_EXTI5_9                     = 23,     /*!< EXTI[9:5] interrupts                                     */
  HDL_NVIC_IRQ24_TIMER0_BRK                  = 24,     /*!< TIMER0 break interrupts                                  */
  HDL_NVIC_IRQ25_TIMER0_UP                   = 25,     /*!< TIMER0 update interrupts                                 */
  HDL_NVIC_IRQ26_TIMER0_TRG_CMT              = 26,     /*!< TIMER0 trigger and commutation interrupts                */
  HDL_NVIC_IRQ27_TIMER0_Channel              = 27,     /*!< TIMER0 channel capture compare interrupts                */
  HDL_NVIC_IRQ28_TIMER1                      = 28,     /*!< TIMER1 interrupt                                         */
  HDL_NVIC_IRQ29_TIMER2                      = 29,     /*!< TIMER2 interrupt                                         */
  HDL_NVIC_IRQ30_TIMER3                      = 30,     /*!< TIMER3 interrupts                                        */
  HDL_NVIC_IRQ31_I2C0_EV                     = 31,     /*!< I2C0 event interrupt                                     */
  HDL_NVIC_IRQ32_I2C0_ER                     = 32,     /*!< I2C0 error interrupt                                     */
  HDL_NVIC_IRQ33_I2C1_EV                     = 33,     /*!< I2C1 event interrupt                                     */
  HDL_NVIC_IRQ34_I2C1_ER                     = 34,     /*!< I2C1 error interrupt                                     */
  HDL_NVIC_IRQ35_SPI0                        = 35,     /*!< SPI0 interrupt                                           */
  HDL_NVIC_IRQ36_SPI1                        = 36,     /*!< SPI1 interrupt                                           */
  HDL_NVIC_IRQ37_USART0                      = 37,     /*!< USART0 interrupt                                         */
  HDL_NVIC_IRQ38_USART1                      = 38,     /*!< USART1 interrupt                                         */
  HDL_NVIC_IRQ39_USART2                      = 39,     /*!< USART2 interrupt                                         */
  HDL_NVIC_IRQ40_EXTI10_15                   = 40,     /*!< EXTI[15:10] interrupts                                   */
  HDL_NVIC_IRQ41_RTC_Alarm                   = 41,     /*!< RTC alarm interrupt                                      */
  HDL_NVIC_IRQ42_USBD_WKUP                   = 42,     /*!< USBD Wakeup interrupt                                    */
  HDL_NVIC_IRQ43_TIMER7_BRK                  = 43,     /*!< TIMER7 break interrupts                                  */
  HDL_NVIC_IRQ44_TIMER7_UP                   = 44,     /*!< TIMER7 update interrupts                                 */
  HDL_NVIC_IRQ45_TIMER7_TRG_CMT              = 45,     /*!< TIMER7 trigger and commutation interrupts                */
  HDL_NVIC_IRQ46_TIMER7_Channel              = 46,     /*!< TIMER7 channel capture compare interrupts                */
  HDL_NVIC_IRQ47_ADC2                        = 47,     /*!< ADC2 global interrupt                                    */
  HDL_NVIC_IRQ48_EXMC                        = 48,     /*!< EXMC global interrupt                                    */
  HDL_NVIC_IRQ49_SDIO                        = 49,     /*!< SDIO global interrupt                                    */
  HDL_NVIC_IRQ50_TIMER4                      = 50,     /*!< TIMER4 global interrupt                                  */
  HDL_NVIC_IRQ51_SPI2                        = 51,     /*!< SPI2 global interrupt                                    */
  HDL_NVIC_IRQ52_UART3                       = 52,     /*!< UART3 global interrupt                                   */
  HDL_NVIC_IRQ53_UART4                       = 53,     /*!< UART4 global interrupt                                   */
  HDL_NVIC_IRQ54_TIMER5                      = 54,     /*!< TIMER5 global interrupt                                  */
  HDL_NVIC_IRQ55_TIMER6                      = 55,     /*!< TIMER6 global interrupt                                  */
  HDL_NVIC_IRQ56_DMA1_Channel0               = 56,     /*!< DMA1 channel0 global interrupt                           */
  HDL_NVIC_IRQ57_DMA1_Channel1               = 57,     /*!< DMA1 channel1 global interrupt                           */
  HDL_NVIC_IRQ58_DMA1_Channel2               = 58,     /*!< DMA1 channel2 global interrupt                           */
  HDL_NVIC_IRQ59_DMA1_Channel3_Channel4      = 59,     /*!< DMA1 channel3 and channel4 global Interrupt              */
  HDL_NVIC_IRQ60                             = 60,
  HDL_NVIC_IRQ61                             = 61,
  HDL_NVIC_IRQ62                             = 62,
  HDL_NVIC_IRQ63                             = 63,
  HDL_NVIC_IRQ64                             = 64,
  HDL_NVIC_IRQ65                             = 65,
  HDL_NVIC_IRQ66                             = 66,
  HDL_NVIC_IRQ67                             = 67,
#endif /* GD32F10X_HD */

#ifdef GD32F10X_XD
  HDL_NVIC_IRQ19_USBD_HP_CAN0_TX             = 19,     /*!< CAN0 TX interrupts                                       */
  HDL_NVIC_IRQ20_USBD_LP_CAN0_RX0            = 20,     /*!< CAN0 RX0 interrupts                                      */
  HDL_NVIC_IRQ21_CAN0_RX1                    = 21,     /*!< CAN0 RX1 interrupts                                      */
  HDL_NVIC_IRQ22_CAN0_EWMC                   = 22,     /*!< CAN0 EWMC interrupts                                     */
  HDL_NVIC_IRQ23_EXTI5_9                     = 23,     /*!< EXTI[9:5] interrupts                                     */
  HDL_NVIC_IRQ24_TIMER0_BRK_TIMER8           = 24,     /*!< TIMER0 break and TIMER8 interrupts                       */
  HDL_NVIC_IRQ25_TIMER0_UP_TIMER9            = 25,     /*!< TIMER0 update and TIMER9 interrupts                      */
  HDL_NVIC_IRQ26_TIMER0_TRG_CMT_TIMER10      = 26,     /*!< TIMER0 trigger and commutation and TIMER10 interrupts    */
  HDL_NVIC_IRQ27_TIMER0_Channel              = 27,     /*!< TIMER0 channel capture compare interrupts                */
  HDL_NVIC_IRQ28_TIMER1                      = 28,     /*!< TIMER1 interrupt                                         */
  HDL_NVIC_IRQ29_TIMER2                      = 29,     /*!< TIMER2 interrupt                                         */
  HDL_NVIC_IRQ30_TIMER3                      = 30,     /*!< TIMER3 interrupts                                        */
  HDL_NVIC_IRQ31_I2C0_EV                     = 31,     /*!< I2C0 event interrupt                                     */
  HDL_NVIC_IRQ32_I2C0_ER                     = 32,     /*!< I2C0 error interrupt                                     */
  HDL_NVIC_IRQ33_I2C1_EV                     = 33,     /*!< I2C1 event interrupt                                     */
  HDL_NVIC_IRQ34_I2C1_ER                     = 34,     /*!< I2C1 error interrupt                                     */
  HDL_NVIC_IRQ35_SPI0                        = 35,     /*!< SPI0 interrupt                                           */
  HDL_NVIC_IRQ36_SPI1                        = 36,     /*!< SPI1 interrupt                                           */
  HDL_NVIC_IRQ37_USART0                      = 37,     /*!< USART0 interrupt                                         */
  HDL_NVIC_IRQ38_USART1                      = 38,     /*!< USART1 interrupt                                         */
  HDL_NVIC_IRQ39_USART2                      = 39,     /*!< USART2 interrupt                                         */
  HDL_NVIC_IRQ40_EXTI10_15                   = 40,     /*!< EXTI[15:10] interrupts                                   */
  HDL_NVIC_IRQ41_RTC_Alarm                   = 41,     /*!< RTC alarm interrupt                                      */
  HDL_NVIC_IRQ42_USBD_WKUP                   = 42,     /*!< USBD wakeup interrupt                                    */
  HDL_NVIC_IRQ43_TIMER7_BRK_TIMER11          = 43,     /*!< TIMER7 break and TIMER11 interrupts                      */
  HDL_NVIC_IRQ44_TIMER7_UP_TIMER12           = 44,     /*!< TIMER7 update and TIMER12 interrupts                     */
  HDL_NVIC_IRQ45_TIMER7_TRG_CMT_TIMER13      = 45,     /*!< TIMER7 trigger and commutation and TIMER13 interrupts    */
  HDL_NVIC_IRQ46_TIMER7_Channel              = 46,     /*!< TIMER7 channel capture compare interrupts                */
  HDL_NVIC_IRQ47_ADC2                        = 47,     /*!< ADC2 global interrupt                                    */
  HDL_NVIC_IRQ48_EXMC                        = 48,     /*!< EXMC global interrupt                                    */
  HDL_NVIC_IRQ49_SDIO                        = 49,     /*!< SDIO global interrupt                                    */
  HDL_NVIC_IRQ50_TIMER4                      = 50,     /*!< TIMER4 global interrupt                                  */
  HDL_NVIC_IRQ51_SPI2                        = 51,     /*!< SPI2 global interrupt                                    */
  HDL_NVIC_IRQ52_UART3                       = 52,     /*!< UART3 global interrupt                                   */
  HDL_NVIC_IRQ53_UART4                       = 53,     /*!< UART4 global interrupt                                   */
  HDL_NVIC_IRQ54_TIMER5                      = 54,     /*!< TIMER5 global interrupt                                  */
  HDL_NVIC_IRQ55_TIMER6                      = 55,     /*!< TIMER6 global interrupt                                  */
  HDL_NVIC_IRQ56_DMA1_Channel0               = 56,     /*!< DMA1 channel0 global interrupt                           */
  HDL_NVIC_IRQ57_DMA1_Channel1               = 57,     /*!< DMA1 channel1 global interrupt                           */
  HDL_NVIC_IRQ58_DMA1_Channel2               = 58,     /*!< DMA1 channel2 global interrupt                           */
  HDL_NVIC_IRQ59_DMA1_Channel3_Channel4      = 59,     /*!< DMA1 channel3 and channel4 global interrupt              */
  HDL_NVIC_IRQ60                             = 60,
  HDL_NVIC_IRQ61                             = 61,
  HDL_NVIC_IRQ62                             = 62,
  HDL_NVIC_IRQ63                             = 63,
  HDL_NVIC_IRQ64                             = 64,
  HDL_NVIC_IRQ65                             = 65,
  HDL_NVIC_IRQ66                             = 66,
  HDL_NVIC_IRQ67                             = 67,
#endif /* GD32F10X_XD */

#ifdef GD32F10X_CL
  HDL_NVIC_IRQ19_CAN0_TX                     = 19,     /*!< CAN0 TX interrupts                                       */
  HDL_NVIC_IRQ20_CAN0_RX0                    = 20,     /*!< CAN0 RX0 interrupts                                      */
  HDL_NVIC_IRQ21_CAN0_RX1                    = 21,     /*!< CAN0 RX1 interrupts                                      */
  HDL_NVIC_IRQ22_CAN0_EWMC                   = 22,     /*!< CAN0 EWMC interrupts                                     */
  HDL_NVIC_IRQ23_EXTI5_9                     = 23,     /*!< EXTI[9:5] interrupts                                     */
  HDL_NVIC_IRQ24_TIMER0_BRK                  = 24,     /*!< TIMER0 break interrupts                                  */
  HDL_NVIC_IRQ25_TIMER0_UP                   = 25,     /*!< TIMER0 update interrupts                                 */
  HDL_NVIC_IRQ26_TIMER0_TRG_CMT              = 26,     /*!< TIMER0 trigger and commutation interrupts                */
  HDL_NVIC_IRQ27_TIMER0_Channel              = 27,     /*!< TIMER0 channel capture compare interrupts                */
  HDL_NVIC_IRQ28_TIMER1                      = 28,     /*!< TIMER1 interrupt                                         */
  HDL_NVIC_IRQ29_TIMER2                      = 29,     /*!< TIMER2 interrupt                                         */
  HDL_NVIC_IRQ30_TIMER3                      = 30,     /*!< TIMER3 interrupts                                        */
  HDL_NVIC_IRQ31_I2C0_EV                     = 31,     /*!< I2C0 event interrupt                                     */
  HDL_NVIC_IRQ32_I2C0_ER                     = 32,     /*!< I2C0 error interrupt                                     */
  HDL_NVIC_IRQ33_I2C1_EV                     = 33,     /*!< I2C1 event interrupt                                     */
  HDL_NVIC_IRQ34_I2C1_ER                     = 34,     /*!< I2C1 error interrupt                                     */
  HDL_NVIC_IRQ35_SPI0                        = 35,     /*!< SPI0 interrupt                                           */
  HDL_NVIC_IRQ36_SPI1                        = 36,     /*!< SPI1 interrupt                                           */
  HDL_NVIC_IRQ37_USART0                      = 37,     /*!< USART0 interrupt                                         */
  HDL_NVIC_IRQ38_USART1                      = 38,     /*!< USART1 interrupt                                         */
  HDL_NVIC_IRQ39_USART2                      = 39,     /*!< USART2 interrupt                                         */
  HDL_NVIC_IRQ40_EXTI10_15                   = 40,     /*!< EXTI[15:10] interrupts                                   */
  HDL_NVIC_IRQ41_RTC_ALARM                   = 41,     /*!< RTC alarm interrupt                                      */
  HDL_NVIC_IRQ42_USBFS_WKUP                  = 42,     /*!< USBFS wakeup interrupt                                   */
  HDL_NVIC_IRQ43_TIMER7_BRK                  = 43,     /*!< TIMER7 break interrupts                                  */
  HDL_NVIC_IRQ44_TIMER7_UP                   = 44,     /*!< TIMER7 update interrupts                                 */
  HDL_NVIC_IRQ45_TIMER7_TRG_CMT              = 45,     /*!< TIMER7 trigger and commutation interrupts                */
  HDL_NVIC_IRQ46_TIMER7_Channel              = 46,     /*!< TIMER7 channel capture compare interrupts                */
  HDL_NVIC_IRQ47                             = 47,
  HDL_NVIC_IRQ48_EXMC                        = 48,     /*!< EXMC global interrupt                                    */
  HDL_NVIC_IRQ49                             = 49,
  HDL_NVIC_IRQ50_TIMER4                      = 50,     /*!< TIMER4 global interrupt                                  */
  HDL_NVIC_IRQ51_SPI2                        = 51,     /*!< SPI2 global interrupt                                    */
  HDL_NVIC_IRQ52_UART3                       = 52,     /*!< UART3 global interrupt                                   */
  HDL_NVIC_IRQ53_UART4                       = 53,     /*!< UART4 global interrupt                                   */
  HDL_NVIC_IRQ54_TIMER5                      = 54,     /*!< TIMER5 global interrupt                                  */
  HDL_NVIC_IRQ55_TIMER6                      = 55,     /*!< TIMER6 global interrupt                                  */
  HDL_NVIC_IRQ56_DMA1_Channel0               = 56,     /*!< DMA1 channel0 global interrupt                           */
  HDL_NVIC_IRQ57_DMA1_Channel1               = 57,     /*!< DMA1 channel1 global interrupt                           */
  HDL_NVIC_IRQ58_DMA1_Channel2               = 58,     /*!< DMA1 channel2 global interrupt                           */
  HDL_NVIC_IRQ59_DMA1_Channel3               = 59,     /*!< DMA1 channel3 global interrupt                           */
  HDL_NVIC_IRQ60_DMA1_Channel4               = 60,     /*!< DMA1 channel3 global interrupt                           */
  HDL_NVIC_IRQ61_ENET                        = 61,     /*!< ENET global interrupt                                    */
  HDL_NVIC_IRQ62_ENET_WKUP                   = 62,     /*!< ENET Wakeup interrupt                                    */
  HDL_NVIC_IRQ63_CAN1_TX                     = 63,     /*!< CAN1 TX interrupt                                        */
  HDL_NVIC_IRQ64_CAN1_RX0                    = 64,     /*!< CAN1 RX0 interrupt                                       */
  HDL_NVIC_IRQ65_CAN1_RX1                    = 65,     /*!< CAN1 RX1 interrupt                                       */
  HDL_NVIC_IRQ66_CAN1_EWMC                   = 66,     /*!< CAN1 EWMC interrupt                                      */
  HDL_NVIC_IRQ67_USBFS                       = 67,     /*!< USBFS global interrupt                                   */
#endif /* GD32F10X_CL */
  HDL_NVIC_IRQ68                             = 68,
  HDL_NVIC_IRQ69                             = 69,
  HDL_NVIC_IRQ70                             = 70,
  HDL_NVIC_IRQ71                             = 71,
  HDL_NVIC_IRQ72                             = 72,
  HDL_NVIC_IRQ73                             = 73,
  HDL_NVIC_IRQ74                             = 74,
  HDL_NVIC_IRQ75                             = 75,
  HDL_NVIC_IRQ76                             = 76,
  HDL_NVIC_IRQ77                             = 77,
  HDL_NVIC_IRQ78                             = 78,
  HDL_NVIC_IRQ79                             = 79,
} hdl_nvic_irq_n_t;

typedef struct {
  hdl_nvic_irq_n_t irq_type;
  uint8_t priority_group;
  uint8_t priority;
  PRIVATE(hw, HDL_INTERRUPT_PRV_SIZE);
} hdl_nvic_interrupt_t;

typedef struct {
  hdl_module_t module;
  uint32_t prio_bits;
  hdl_nvic_interrupt_t **interrupts;
} hdl_nvic_t;

typedef struct{
  hdl_module_t module;
  uint32_t flash_latency;
} hdl_core_t;

#define hdl_interrupts(...) ((hdl_nvic_interrupt_t *[]){__VA_ARGS__, NULL})

typedef hdl_nvic_t hdl_interrupt_controller_t;
typedef hdl_nvic_interrupt_t hdl_interrupt_t;
typedef hdl_nvic_irq_n_t hdl_irq_n_t;

#endif // PORT_CORE_H_
